"""
Задание 3
Пользователь вводит с клавиатуры два числа (начало
и конец диапазона). Требуется проанализировать все числа
в этом диапазоне. Вывод на экран должен проходить по
правилам, указанным ниже.
    Если число кратно 3 (делится на 3 без остатка) нужно
вывести слово Fizz. Если число кратно 5 нужно вывести
слово Buzz. Если число кратно 3 и 5 нужно вывести
Fizz Buzz. Если число не кратно не 3 и 5 нужно вывести
само число.

"""

num_1 = int(input("Введіть перше число: "))
num_2 = int(input("Введіть друге число: "))

sum_A = 0

if num_1 < num_2:   # якщо введено спочатку менше число

    num_2 += 1 #для вирівнювання числового ряду

    for i in range(num_1 , num_2):       # Всі числа діапазона
        if i % 3 == 0:
            print(i, " = Fizz")

    for i in range(num_1, num_2):
        if i % 5 == 0:
            print(i, " = Buzz")
    
    for i in range(num_1, num_2):
        if i % 3 and i % 5 == 0:
            print("Числа кратні 3 і 5 - ", i, " = Fzz Buzz")
    
    for i in range(num_1, num_2):
        if i % 3 and i % 5 !=0:
            print("Числа не кратні ні 3 і 5 = ", i)

else:           # якщо введено спочатку більше число
   
    num_1 += 1 #для вирівнювання числового ряду

    for i in range(num_2, num_1):       # Всі числа діапазона
        if i % 3 == 0:
            print(i, " = Fizz")

    for i in range(num_2, num_1):
        if i % 5 == 0:
            print(i, " = Buzz")
    
    for i in range(num_2, num_1):
        if i % 3 and i % 5 == 0:
            print("Числа кратні 3 і 5 - ", i, " = Fzz Buzz")

    for i in range(num_2, num_1):
        if i % 3 and i % 5 !=0:
            print("Числа не кратні ні 3 і 5 = ", i)
