"""
Задание 2
Пользователь вводит с клавиатуры два числа (начало и конец диапазона). Требуется проанализировать все
числа в этом диапазоне. Нужно вывести на экран:
1. Все числа диапазона;
2. Все числа диапазона в убывающем порядке;
3. Все числа, кратные 7;
4. Количество чисел, кратных 5.

"""

num_1 = int(input("Введіть перше число: "))
num_2 = int(input("Введіть друге число: "))

sum_A = 0

if num_1 < num_2:   # якщо введено спочатку менше число

    num_2 += 1 #для вирівнювання числового ряду

    for i in range(num_1, num_2):       # Всі числа діапазона
        print ("Всі числа діапазона: ", i)
    
    num_1 -= 1 #для вирівнювання числового ряду
    num_2 -= 1 #для вирівнювання числового ряду

    for q in range(num_2, num_1, -1):    # числа в порядку спадання
        print ("Всі числа діапазона в порядку спадання: ", q)

    for i in range(num_1, num_2):       # числа кратні 7
        if i % 7 == 0:
            print("Числа: ", i)

    for i in range(num_1, num_2):       # кількість чисел кратні 5
        if i % 5 == 0:
            sum_A += 1
    
    print("Кількість чисел кратні 5 : ", sum_A)

        
else:          # якщо введено спочатку більше число

    num_1 += 1 #для вирівнювання числового ряду

    for i in range(num_2, num_1):
        print ("Всі числа діапазона: ", i)

    num_1 -=1 #для вирівнювання числового ряду
    num_2 -=1 #для вирівнювання числового ряду

    for q in range(num_1, num_2, -1):   # числа в порядку спадання
        print ("Всі числа діапазона в порядку спадання: ", q)

    for i in range(num_2, num_1):       # числа кратні 7
        if i % 7 == 0:
            print("Числа: ", i)
        
    for i in range(num_2, num_1):       # кількість чисел кратні 5
        if i % 5 == 0:
            sum_A += 1
    print("Кількість чисел кратні 5 : ", sum_A)