'''
Задание 2
Пользователь вводит с клавиатуры некоторый текст,
после чего пользователь вводит список зарезервированных
слов. Необходимо найти в тексте все зарезервированные
слова и изменить их регистр на верхний. Вывести на
экран измененный текст. 
'''

messag_e = input("Введіть текст: ")
message_1 = input("Введіть слова: ")
print(messag_e.find(message_1))


