'''
Задание 1
Два списка целых заполняются случайными числами.
Необходимо:
1. Сформировать третий список, содержащий элементы
обоих списков;
2. Сформировать третий список, содержащий элементы
обоих списков без повторений;
3. Сформировать третий список, содержащий элементы
общие для двух списков;
4. Сформировать третий список, содержащий только
уникальные элементы каждого из списков;
5. Сформировать третий список, содержащий только
минимальное и максимальное значение каждого из
списков.
'''


# my_listOne = [16, 11, 12, 2, 4, 9, 13, 1]   # тест
# my_listTwo = [8, 4, 6, 2, 10, 3]            # тест


my_list2 = [] # змінна з результатом завдання 2
my_list3 = [] # змінна з результатом завдання 2
my_list4 = [] # змінна з результатом завдання 2
my_list5 = [] # змінна з результатом завдання 5


##################-1-####################

my_list1 = my_listOne + my_listTwo # змінна my_list1 з результатом завдання 1
print("Елементи двух списків: ", my_list1, '\n')

##################-2-####################

list_tmp = my_listOne[:]
for i in my_listTwo:
    if i not in list_tmp:
        list_tmp.append(i)
for i in list_tmp:
    if i not in my_list2:
        my_list2.append(i)
print("Елементи двух списків без повторень: ", my_list2, '\n')

##################-3-####################

for i in my_listTwo:
	if i in my_listOne and i not in my_list3:
		my_list3.append(i)	
print("Список який містить загальні елементи списків: ", my_list3, '\n')

##################-4-####################

for i in my_listOne:
	if i not in my_listTwo and i not in my_list4:
		my_list4.append(i)
for i in my_listTwo:
	if i not in my_listOne and i not in my_list4:
		my_list4.append(i)
print("Список який містить унікальні елементи списків: ", my_list4, '\n')

##################-5-####################

my_list5.append(min(my_listOne))
my_list5.append(max(my_listOne))
my_list5.append(min(my_listTwo))
my_list5.append(max(my_listTwo))
print("Елементи мінімільних та максимальних значень двух списків: ", my_list5, '\n')
